'''
Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Пример:
- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]

'''
list = [2, 3, 5, 12]
print(list, '=>', end=" " )
new_list=[]

if len(list)%2==0:
    k=len(list)//2
else:
    k=len(list)//2+1

for i in range(k):
    new_list.append(list[i]*list[-1-i])
print(new_list)
